Repository: AJARProject/AJ_Tools_xliff
Catalog: HDI_AJ_Tool_xliff.4dbase/Components/AJ_Tools_xliff.4dbase/Resources/*.lproj/AJ_Tools_xliff.xlf
Languages: fr

# AJ_Tools_xliff.error.cannotDelete
source: An error occurs while trying to delete!
fr: Une erreur est survenue lors de la suppression!

# AJ_Tools_xliff.error.cannotLaunchMustDefineDataclasses
source: You cannot launch the Xliff Editor, you must set the 4 dataclasses with the $1 method.
fr: Vous ne pouvez pas lancé l'editeur Xliff, vous devez définir les dataclasses à 'aide de la méthode $1

# AJ_Tools_xliff.error.cannotUpdateLockedString
source: Some string could not get updated because they are locked by someone else. Process Aborted Locked Strings : s
fr: Certaines chaines ne peuvent pas être modifié car elles sont verrouillées par d'autres utilisateurs. Processus annulé. Chaines verrouillées :

# AJ_Tools_xliff.error.duringSave
source: An Error occurs during the save please try again
fr: Une erreur est survenue pendant la sauvegarde, veuillez réessayer.

# AJ_Tools_xliff.error.recordLockedByAnotherUser
source: Record locked by another user.
fr: Enregistrement verrouillé par un autre utilisateur.

# AJ_Tools_xliff.error.savingLanguage
source: Process aborted, an issue occurs while saving the $1 language. $2
fr: Processus interrompu, une erreur est survenu pendant la sauvegarde de la langue $1. $2

# AJ_Tools_xliff.error.templateMissing
source: The xliff template is missing. Please be sure the file is located in the resources folder of the component.
fr: Le fichier de template xliff est manquant. Veuillez vérifier que le fichier est bien présent dans le dossier "Resources" du composant.

# AJ_Tools_xliff.label.cancel
source: Cancel
fr: Annuler

# AJ_Tools_xliff.label.copyCode
source: Copy Code
fr: Copier le code

# AJ_Tools_xliff.label.copyText
source: Copy Text
fr: Copier le text

# AJ_Tools_xliff.label.copyXliff
source: Copy :xliff:
fr: Copier le :xliff:

# AJ_Tools_xliff.label.demoMode
source: Demo Mode
fr: Mode Démo

# AJ_Tools_xliff.label.edit
source: Edit
fr: Edition

# AJ_Tools_xliff.label.exporting
source: Exporting
fr: Export

# AJ_Tools_xliff.label.exportXliffFiles
source: Export Xliff Files
fr: Exporter les fichiers XLIFF

# AJ_Tools_xliff.label.file
source: File
fr: Fichier

# AJ_Tools_xliff.label.files
source: Files
fr: Fichiers

# AJ_Tools_xliff.label.groups
source: Groups
fr: Groupes

# AJ_Tools_xliff.label.importing
source: Importing
fr: Import

# AJ_Tools_xliff.label.importXliffFiles
source: Import XLIFF Files
fr: Importer les fichiers XLIFF

# AJ_Tools_xliff.label.languages
source: Languages
fr: Langues

# AJ_Tools_xliff.label.lockedBy
source: locked by
fr: verrouillé par

# AJ_Tools_xliff.label.no
source: No
fr: Non

# AJ_Tools_xliff.label.save
source: Save
fr: Sauver

# AJ_Tools_xliff.label.showAll
source: Show all
fr: Tout afficher

# AJ_Tools_xliff.label.strings
source: Strings
fr: Chaines

# AJ_Tools_xliff.label.xliffEditor
source: XLIFF EDITOR
fr: EDITEUR XLIFF

# AJ_Tools_xliff.label.xliffExportedThe
source: Xliff exported the
fr: Xliff exporté le

# AJ_Tools_xliff.label.xliffImportedThe
source: Xliff imported the
fr: Xliff importés le

# AJ_Tools_xliff.label.yes
source: Yes
fr: Oui

# AJ_Tools_xliff.message.anotherUser
source: another user
fr: un autre utilisateur

# AJ_Tools_xliff.message.ask.editLanguageName
source: Do you want to edit the name of the language? This will update all the existing data!
fr: Voulez-vous modifier le nom de la langue? Cela va modifier toutes les données existantes.

# AJ_Tools_xliff.message.ask.exportXliffFiles
source: Are you sure that you want to export the xliff files? This will erase the existing xliff files on the server!
fr: Êtes-vous sur de vouloir exporter les fichiers xliff? Cela va ecraser les fichiers xliff existants sur le serveur!

# AJ_Tools_xliff.message.ask.importXliffFiles
source: Are you sure that you want to import the xliff files? The current modifications will be lost !
fr: Êtes-vous sur de vouloir importer les fichiers xliff? Les modifications courrantes vont être perdues !

# AJ_Tools_xliff.message.ask.inEditionSaveOrCancel
source: You are editing a string, would you like to save or cancel the modification?
fr: Vous avez edité une chaine, voulez-vous sauver ou annuler?

# AJ_Tools_xliff.message.ask.removeFile
source: Are you sure to remove this file ($1) ? This will remove all the groups and strings related to !
fr: Êtes-vous sur de vouloir supprimer ce fichier ($1) ? Cela va supprimer tous les groupes et chaines liés !

# AJ_Tools_xliff.message.ask.removeGroup
source: Are you sure to remove this group ($1) ? This will remove all the strings related to !
fr: Êtes-vous sur de vouloir supprimer ce groupe ($1) ? Cela va supprimer toutes les chaines liés !

# AJ_Tools_xliff.message.ask.removeLanguage
source: Are you sure to remove this language ($1) ?
fr: Êtes-vous sur de vouloir supprimer cette langue ($1) ?

# AJ_Tools_xliff.message.ask.removeString
source: Are you sure to remove this string ($1) ?
fr: Êtes-vous sur de vouloir supprimer cette chaine ($1) ?

# AJ_Tools_xliff.message.changeGroup
source: Change the group
fr: Changer le group

# AJ_Tools_xliff.message.currentDatabaseLanguage
source: Current Database Language
fr: Langue courante de la base

# AJ_Tools_xliff.message.demo.cannotHaveMoreFiles
source: This is a demo ! You cannot have more than 4 files.
fr: Ceci est une démo ! Vous ne pouvez avoir plus de 4 fichiers.

# AJ_Tools_xliff.message.demo.cannotHaveMoreGroups
source: This is a demo ! You cannot have more than 10 groups per file.
fr: Ceci est une démo ! Vous ne pouvez avoir plus de 10 groupes par fichier.

# AJ_Tools_xliff.message.demo.cannotHaveMoreStrings
source: This is a demo ! You cannot have more than 10 strings per group.
fr: Ceci est une démo ! Vous ne pouvez avoir plus de 10 chaines par groupe.

# AJ_Tools_xliff.message.editFileName
source: Edit the file name
fr: Modifier le nom du fichier

# AJ_Tools_xliff.message.editGroupName
source: Edit the Group Name
fr: Modifier le nom du group

# AJ_Tools_xliff.message.editLanguageName
source: Edit the language name
fr: Modifier le nom de la langue

# AJ_Tools_xliff.message.editStringName
source: Edit the String Name
fr: Modifier le nom de la chaine

# AJ_Tools_xliff.message.exportDone
source: Export Done !
fr: Export Finit !

# AJ_Tools_xliff.message.exportingFiles
source: Exporting files...
fr: Export des fichiers...

# AJ_Tools_xliff.message.exportingFolders
source: Exporting folders...
fr: Export des dossiers...

# AJ_Tools_xliff.message.importDone
source: Import Done !
fr: Import Finit !

# AJ_Tools_xliff.message.importingFiles
source: Importing files...
fr: Import des fichiers...

# AJ_Tools_xliff.message.importingFolders
source: Importing folders...
fr: Import des dossiers...

# AJ_Tools_xliff.message.importingGroups
source: Importing groups...
fr: Import des groupes...

# AJ_Tools_xliff.message.languageChanged
source: Language Changed!
fr: Langue Changée!

# AJ_Tools_xliff.message.mustDefineSourceLanguage
source: You must define a source language. You can right-clic on a language to define the source language
fr: Vous devez définir une langue source. Vous pouvez faire un clic-droit sur une langue dans l'éditeur afin de définir une langue source.

# AJ_Tools_xliff.message.nameMustBeUnique
source: !!! The name must be unique !!!
fr: !!! Le nom doit être unique !!!

# AJ_Tools_xliff.message.newFileName
source: Enter the name of the new file
fr: Entrez le nom du nouveau fichier

# AJ_Tools_xliff.message.newGroupName
source: Enter the name of the new group
fr: Entrez le nom du nouveau group

# AJ_Tools_xliff.message.newLanguageName
source: Enter the name of the new language
fr: Entrez le nom de la nouvelle langue

# AJ_Tools_xliff.message.newStringName
source: Enter the name of the new String
fr: Entrez le nom de la nouvelle chaine

# AJ_Tools_xliff.message.noMissingTranslations
source: No missing translations
fr: Pas de traductions manquantes

# AJ_Tools_xliff.message.recordLockedBy
source: Record locked by
fr: Enregistrement verrouillé par

# AJ_Tools_xliff.message.selectFileForNewGroup
source: Please select a file where you want to add a group.
fr: Veuillez séléctionner un fichier où ajouter le nouveau group.

# AJ_Tools_xliff.message.selectGroupForNewString
source: Please select a group where you want to add a string.
fr: Veuillez séléctionner un group où ajouter la nouvelle chaine.

# AJ_Tools_xliff.message.selectNewGroup
source: Select another group
fr: Séléctionner un autre group

# AJ_Tools_xliff.message.setCurrentDatabaseLanguage
source: Set Current Database Language
fr: Fixer la langue de la base

# AJ_Tools_xliff.message.setSourceLanguage
source: Set Source Language
fr: Définir comme langue source

# AJ_Tools_xliff.message.showAllMissingTranslations
source: Show all missing translations
fr: Afficher toutes les traductions manquantes

# AJ_Tools_xliff.message.sourceLanguage
source: Source Language
fr: Langue source

# AJ_Tools_xliff.message.sourceLanguageChanged
source: Source Language Changed
fr: Langue source changée
